<h1><center>Intro to Pandas for Data Analysts</center></h1>
<h3><center>(PART 2)</center></h3>
<img src="images/pandas.png" alt="Pandas" width="400" height="400">

## Agenda

- Use the rename function to rename columns 
- Check for duplicate data 
- Filter data using `.iloc` and .`loc` indexers

## The DATA 

- Dataset is the `students.csv` file in the data folder taken from [Kaggle](https://www.kaggle.com/datasets/erqizhou/students-data-analysis?resource=download)
- It is a fictional dataset, however, the goal is to analyze the data to see what may impact a student's probability in applying for graduate school 
- Race is a censored feature (still may be useful)
- Assume the higher the math score the better the academic performance in that math subject 
- `form1-form4` columns are censored and represents a students background (data dictionary can be found on Kaggle link above)

- The target variable, y, is 0: failed to apply, 1: applied within country, 2: applied abroad

### Step 1:  Import pandas package

In [1]:
#pd is considered an alias so we don't have to type pandas each time

import pandas as pd

### Step 2:  Read in a `.csv` file as a Pandas DataFrame Object

In [2]:
students = pd.read_csv('data/students.csv')

In [3]:
#check the head of the data 

students.head()

,ID,class,gender,race,GPA,Algebra,Calculus1,Calculus2,Statistics,Probability,Measure,Functional_analysis,from1,from2,from3,from4,y
0,1141,A,male,1,73.47,64,81,87,60,74,71,60,A,A,A,3,0
1,1142,A,female,1,71.22,57,50,51,51,55,62,61,B,A,A,2,0
2,1143,A,female,2,74.56,47,48,71,60,61,68,64,C,A,A,0,1
3,1144,A,female,1,72.89,46,72,38,60,29,54,51,D,A,A,0,0
4,1145,A,female,1,70.11,49,45,63,60,66,66,61,E,A,A,0,0

### Step 3:  Rename Columns 

Use the `.rename` method and pass in a `dictionary` of columns you want to rename 

[Rename Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.rename.html)

In [4]:
### Rename variable y to "Applied_Grad_school"

students = students.rename(columns={"y": "Applied_Grad_school"})

In [5]:
### Rename ID to "Student_ID"

students = students.rename(columns={'ID': 'Student_ID'})

In [6]:
### Check the head 

students.head()

,Student_ID,class,gender,race,GPA,Algebra,Calculus1,Calculus2,Statistics,Probability,Measure,Functional_analysis,from1,from2,from3,from4,Applied_Grad_school
0,1141,A,male,1,73.47,64,81,87,60,74,71,60,A,A,A,3,0
1,1142,A,female,1,71.22,57,50,51,51,55,62,61,B,A,A,2,0
2,1143,A,female,2,74.56,47,48,71,60,61,68,64,C,A,A,0,1
3,1144,A,female,1,72.89,46,72,38,60,29,54,51,D,A,A,0,0
4,1145,A,female,1,70.11,49,45,63,60,66,66,61,E,A,A,0,0

### Step 4:  Check for Duplicates 

Before dropping duplicates ask "is there a reason to have duplicates" (maybe it is transaction data where one row is a transaction and a customer can make more than one transaction) 

View the `.duplicated` method [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html).

In [12]:
#Check to see if there are duplicates in the ID column 

students.duplicated(subset=['Student_ID']).sum()

0

In [ ]:
#Add a .sum() at the end to sum up any 'True' values (which would indicate that there is a duplicate)

### Step 5:  Slice (or Index) the Data

.iloc vs. .loc 

- .iloc is integer based filtering 
- .loc is label based filtering 

 **loc[row_label, column_label]** <br>
 **iloc[row_position, column_position]**
 
Use `:` to select everything 

More info here: [iloc/loc for Pandas](https://towardsdatascience.com/how-to-use-loc-and-iloc-for-selecting-data-in-pandas-bd09cb4c3d79)

In [13]:
# Check the head 
students.head()

,Student_ID,class,gender,race,GPA,Algebra,Calculus1,Calculus2,Statistics,Probability,Measure,Functional_analysis,from1,from2,from3,from4,Applied_Grad_school
0,1141,A,male,1,73.47,64,81,87,60,74,71,60,A,A,A,3,0
1,1142,A,female,1,71.22,57,50,51,51,55,62,61,B,A,A,2,0
2,1143,A,female,2,74.56,47,48,71,60,61,68,64,C,A,A,0,1
3,1144,A,female,1,72.89,46,72,38,60,29,54,51,D,A,A,0,0
4,1145,A,female,1,70.11,49,45,63,60,66,66,61,E,A,A,0,0

In [14]:
# Filter for the ID, Class, and Algebra columns 

students.loc[:, ["Student_ID", "class", "Algebra"]]

     Student_ID class  Algebra
0          1141     A       64
1          1142     A       57
2          1143     A       47
3          1144     A       46
4          1145     A       49
..          ...   ...      ...
100        1241     A       87
101        1242     B       98
102        1243     B       83
103        1244     A       92
104        1245     A       93

[105 rows x 3 columns]

In [15]:
#Check the .info 

students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 17 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Student_ID           105 non-null    int64
 1   class                105 non-null    object
 2   gender               105 non-null    object
 3   race                 105 non-null    int64
 4   GPA                  105 non-null    float64
 5   Algebra              105 non-null    int64
 6   Calculus1            105 non-null    int64
 7   Calculus2            105 non-null    int64
 8   Statistics           105 non-null    int64
 9   Probability          105 non-null    int64
 10  Measure              105 non-null    int64
 11  Functional_analysis  105 non-null    int64
 12  from1                105 non-null    object
 13  from2                105 non-null    object
 14  from3                105 non-null    object
 15  from4                105 non-null    int64
 16  Applied_Grad_school  105 non-null    int64
dtypes: float64(1), int64(11), object(5)
memory usage: 14.1+ KB

In [16]:
#Do the same thing with .iloc 

x = students.iloc[:, [0, 1, 5]]
x.head()

   Student_ID class  Algebra
0        1141     A       64
1        1142     A       57
2        1143     A       47
3        1144     A       46
4        1145     A       49

In [17]:
## Use .iloc to select for the first two rows and columns 

students.iloc[0:2, 0:2]

   Student_ID class
0        1141     A
1        1142     A

### Step 6:  Filter Data

In [18]:
#Filter for Class 'A' and store it as the new_data object

new_data = students.loc[students['class']== 'A']
new_data.head()

,Student_ID,class,gender,race,GPA,Algebra,Calculus1,Calculus2,Statistics,Probability,Measure,Functional_analysis,from1,from2,from3,from4,Applied_Grad_school
0,1141,A,male,1,73.47,64,81,87,60,74,71,60,A,A,A,3,0
1,1142,A,female,1,71.22,57,50,51,51,55,62,61,B,A,A,2,0
2,1143,A,female,2,74.56,47,48,71,60,61,68,64,C,A,A,0,1
3,1144,A,female,1,72.89,46,72,38,60,29,54,51,D,A,A,0,0
4,1145,A,female,1,70.11,49,45,63,60,66,66,61,E,A,A,0,0

In [20]:
#filter for race = 2 and store it as new_data_race 

new_data_race = students.loc[(students['class']== 'A') & 
                            (students['race'] == 2)]
new_data_race.head()

,Student_ID,class,gender,race,GPA,Algebra,Calculus1,Calculus2,Statistics,Probability,Measure,Functional_analysis,from1,from2,from3,from4,Applied_Grad_school
2,1143,A,female,2,74.56,47,48,71,60,61,68,64,C,A,A,0,1
32,1173,A,male,2,74.17,63,73,61,83,72,55,62,C,A,A,0,0
96,1237,A,male,2,91.74,94,100,96,97,95,94,93,C,B,S,0,2

In [21]:
#Now lets combine the two filters above for Class = A and race = 2

final_data = students.loc[(students['class']== 'A') & (students['race'] == 2)]
final_data.head()

,Student_ID,class,gender,race,GPA,Algebra,Calculus1,Calculus2,Statistics,Probability,Measure,Functional_analysis,from1,from2,from3,from4,Applied_Grad_school
2,1143,A,female,2,74.56,47,48,71,60,61,68,64,C,A,A,0,1
32,1173,A,male,2,74.17,63,73,61,83,72,55,62,C,A,A,0,0
96,1237,A,male,2,91.74,94,100,96,97,95,94,93,C,B,S,0,2

## Summary 

- Pandas is a great package for data exploration and manipulation 
- Everything in Python is an OBJECT -- objects have specific methods and attributes 
- Rename columns by using the `.rename()` function and passing a dictionary as an argument 
- Don't forget to vhevk for duplicates -- duplicates can throw off your analysis 
- `.iloc` and `.loc` are great for filtering your data set

<h1><center>The End</center></h1>
<h2><center>@LearningwithJelly</center></h2>

In [1]:
from traitlets.config.manager import BaseJSONConfigManager
from pathlib import Path
path = Path.home() / ".jupyter" / "nbconfig"
cm = BaseJSONConfigManager(config_dir=str(path))
cm.update(
    "rise",
    {
        "theme": "white",
        "transition": "fade",
        "start_slideshow_at": "selected",
        "footer": "  <h6>Learning with Jelly</h6>",
        "header": "  <h3>Intro to Pandas - Part 2</h3>",
        "width":  "90%",
        "height": "110%",
        "enable_chalkboard": True
     }
)

{'theme': 'white',
 'transition': 'fade',
 'start_slideshow_at': 'selected',
 'autolaunch': False,
 'width': '90%',
 'height': '110%',
 'header': '  <h3>Intro to Pandas - Part 2</h3>',
 'footer': '  <h6>Learning with Jelly</h6>',
 'scroll': True,
 'enable_chalkboard': True,
 'slideNumber': True,
 'center': False,
 'controlsLayout': 'edges',
 'hash': True}